src/Catalogs/ОбнаружениеИнцидентовОперативное/ОбнаружениеИнцидентовОперативное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбнаружениеИнцидентовОперативное</name>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеДанныхИнтервал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеДанныхВремя</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеДанныхФункция</name>
    <type>
      <types>EnumRef.ФункцииОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрокаЗначенияПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражениеПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражениеЗамены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеДобавление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантТипаПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФильтра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Счетчики</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.ГруппыСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользованиеОперативнойПамятиПроцессами</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кластер1С</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийСервер1С</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧислоАварийноЗавершенныхПроцессов</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочийСервер</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧислоСеансов</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кластер</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПриложения</name>
      <type>
        <types>EnumRef.ВидыПриложений</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОбнаружения</name>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеСрабатывания</name>
      <type>
        <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСрабатывания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбнаружения</name>
      <type>
        <types>EnumRef.ТипыОбнаруженияИнцидентов</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньИнцидента</name>
      <type>
        <types>EnumRef.УровниИнцидентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОбнаруженияПоУмолчанию</name>
    <attributes>
      <name>УсловиеСрабатывания</name>
      <type>
        <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСрабатывания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбнаружения</name>
      <type>
        <types>EnumRef.ТипыОбнаруженияИнцидентов</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньИнцидента</name>
      <type>
        <types>EnumRef.УровниИнцидентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОбнаружениеИнцидентовОперативное/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Автодобавление(Команда)
    АвтодобавлениеНаСервере(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчас(Команда)
    
    ТекДанные = Элементы.Список.ТекущиеДанные;
    Если ТекДанные <> Неопределено Тогда
        Сообщения = ВыполнитьСейчасНаСервере(ТекДанные.Ссылка, ТекДанные.АгрегированиеДанныхИнтервал, ТекДанные.АгрегированиеДанныхВремя);
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(Сообщения, Символы.ПС));
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    Если Элемент.ТекущийЭлемент.Имя = "Активно" Тогда
        ИзменитьАктивность(ВыбраннаяСтрока);
        СтандартнаяОбработка = Ложь;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура АвтодобавлениеНаСервере(Знач ВыделенныеСтроки)
    
    Для Каждого ТекОбнаружение Из ВыделенныеСтроки Цикл
        Справочники.ОбнаружениеИнцидентовОперативное.ВыполнитьАвтоДобавление(ТекОбнаружение);
    КонецЦикла;
        
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьСейчасНаСервере(Обнаружение, Интервал, Время)
    Возврат Справочники.ОбнаружениеИнцидентовОперативное.ВыполнитьОбнаружение(Обнаружение, Интервал, Время);
КонецФункции

&НаСервере
Процедура ИзменитьАктивность(ОбнаружениеСсылка)
    
    ОбнаружениеОбъект = ОбнаружениеСсылка.ПолучитьОбъект();
    ОбнаружениеОбъект.Активно = НЕ ОбнаружениеОбъект.Активно;
    ОбнаружениеОбъект.Записать();
    Элементы.Список.Обновить();
    
КонецПроцедуры

#КонецОбласти
